#    -*- mode: org -*-

#+TITLE: Solution of non-linear equations
#+AUTHOR: William Oquendo
#+EMAIL: woquendo@gmail.com
#+DATE: 


** Scalar equation
  The following snippet solves the previous example using the =root=
  method:

  #+BEGIN_SRC python :exports both :results output
from scipy import optimize
import numpy as np

def fun(x):
    return np.exp(-x) -x

sol = optimize.root(fun, [0],  method='hybr')
print("Solution: ", sol.x)
print("f(x): ", fun(sol.x[0]))
print(sol)
  #+END_SRC
  
  #+RESULTS:
  #+begin_example
  Solution:  [0.56714329]
  f(x):  0.0
      fjac: array([[-1.]])
       fun: array([0.])
   message: 'The solution converged.'
      nfev: 8
       qtf: array([-3.30757643e-12])
	 r: array([1.56714333])
    status: 1
   success: True
	 x: array([0.56714329])
  #+end_example

** Multidimensional equation (you can also use =fsolve=)
   #+BEGIN_SRC python :exports both :results output
from scipy import optimize
import numpy as np

# x is a list (x[0] = x, x[1] = y)
def fun(x):
    return [x[0]  + 0.5 * (x[0] - x[1])**3 - 1.0, 0.5 * (x[1] - x[0])**3 + x[1]]

sol = optimize.root(fun, [0, 0],  method='hybr')
print("Solution: ", sol.x)
print("f(x): ", fun(sol.x))
print(sol)

   #+END_SRC

   #+RESULTS:
   #+begin_example
   Solution:  [0.8411639 0.1588361]
   f(x):  [-1.1102230246251565e-16, 0.0]
       fjac: array([[-0.89914291,  0.43765515],
	  [-0.43765515, -0.89914291]])
	fun: array([-1.11022302e-16,  0.00000000e+00])
    message: 'The solution converged.'
       nfev: 12
	qtf: array([ 1.19565972e-11, -4.12770392e-12])
	  r: array([-2.16690469,  1.03701789, -1.10605417])
     status: 1
    success: True
	  x: array([0.8411639, 0.1588361])
   #+end_example

